["Jackie Chan doesn't do push-ups; he pushes the Earth down with one finger.",
"Jackie Chan can disarm you with his smile. Then, he disarms you for real.",
"Jackie Chan once filmed a fight scene in reverse, just to see if time would dare argue.",
"Why do Jackie Chan's movies have outtakes? Even gravity needs a few tries to affect him.",
"Jackie Chan doesn’t dodge bullets. Bullets find safer targets.",
"Jackie Chan’s reflexes are so fast, he once caught the speed of light in a net.",
"When Jackie Chan jumps into the water, he doesn’t get wet; the water gets Jackie Channed.",
"Jackie Chan doesn't read scripts. The words assemble themselves out of respect.",
"In chess, Jackie Chan doesn’t say 'checkmate.' He just smiles, and the pieces retire respectfully.",
"Jackie Chan can do a roundhouse kick faster than the speed of sound, creating a silence before the storm.",
"Jackie Chan doesn't wear a watch. He decides what time it is by performing a sun salutation.",
"When Jackie Chan does a somersault, the Earth uses the opportunity to adjust its rotation.",
"Jackie Chan once entered a room and closed the door before the light could escape.",
"Ghosts sit around the campfire and tell Jackie Chan stories.",
"Jackie Chan can tie shoelaces with his feet, while running.",
"When Jackie Chan goes for a swim, he doesn’t get wet. The water gets Jackie Chan’d.",
"Jackie Chan once filmed a movie fight scene so fast, the camera had to catch up.",
"Jackie Chan can carve a sculpture with his bare hands. While it’s still inside the marble.",
"Jackie Chan doesn’t do stunts. Gravity and physics just accommodate his needs.",
"Jackie Chan can speak braille, fluently.",
"Jackie Chan doesn't climb walls; he just walks up them as if they're floors.",
"When Jackie Chan plays hide and seek, even Google can't find him.",
"Jackie Chan can make onions cry.",
"Jackie Chan once did a handstand and pushed the Earth away, creating the first leap year.",
"Jackie Chan’s only workout equipment is the air around him. And even that gets exhausted."]
